#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>


//int check_sys()
//{
//	int a = 1;
//	char*p = (char*)&a;
//	if (*p == 1)
//		return 1;
//	else
//		return 0;
//}
//
//
//int main()
//{
//	//写一段代码告诉我们当前机器的字节序是什么
//	//返回1，小端
//	//返回0，大端
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}


//问输出什么？
//int main()
//{
//	char a = -1;
//	//10000000000000000000000000000001 - 原码
//	//11111111111111111111111111111110 - 反码
//	//11111111111111111111111111111111 - 补码
//	//char类型：11111111
//	//11111111111111111111111111111111 - 整形提升 - 补码
//	//11111111111111111111111111111110 - 反码 ：补码-1
//	//10000000000000000000000000000001 - 原码 ：1
//	signed char b = -1;
//	//char类型：11111111
//	//11111111111111111111111111111111 - 整形提升
//	//同上：b=-1
//	unsigned char c = -1;
//	//char类型：11111111
//	//00000000000000000000000011111111 - 无符号位整形提升补零，无符号位：原码=反码=补码； 
//	//所以 c = 255
//	printf("a=%d b=%d c=%d", a, b, c);//因为%d是打印整形，所以要发生整形提升
//	//输出：-1；-1；255
//	return 0;
//}


//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000
//	//11111111111111111111111101111111
//	//11111111111111111111111110000000 - 补码
//	//10000000
//	//11111111111111111111111110000000 - 整形提升
//	//原码=反码=补码
//
//	printf("%u\n", a);
//	//%d - 打印十进制的有符号数字
//	//%u - 打印十进制的无符号数字
//	return 0;
//	return 0;
//}


//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//	}
//	return 0;
//}

//int main()
//{
//	char a [1000];//char 类型只能存-128到127的数字
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));//找0
//	//-1，-2，-3...-127,128,127...3，2,1,0
//
//	return 0;
//}

int main()
{
	int n = 9;
	float *pFloat = (float*)&n;
	printf("n的值为:%d\n", n);
	printf("*pFloat的值为：%f\n", *pFloat);

	*pFloat = 9.0;
	printf("num的值为:%d\n", n);
	printf("*pFloat的值为：%f\n", *pFloat);

	return 0;
}